experiments/vibethinker/mutations/position-distance-manhattan.patch
diff --git a/crates/mmorpg-core/src/lib.rs b/crates/mmorpg-core/src/lib.rs
--- a/crates/mmorpg-core/src/lib.rs
+++ b/crates/mmorpg-core/src/lib.rs
@@ -224,5 +224,5 @@ impl Position {
     fn distance_squared(self, other: Self) -> f32 {
         let dx = self.x - other.x;
         let dy = self.y - other.y;
-        dx * dx + dy * dy
+        dx.abs() + dy.abs()
     }
